{
    "schemaVersion": "0.1.0",
    "name": "Article",
    "behavior": "create",
    "noteContentFormat": "# {{title}}\nby {{\"a comma separated list of author(s) of this article. Each author should be formatted like this [[author name]]. if there is more than one, separate each by a comma and end with the word and using an Oxford comma.\"}}\n\n> [!summary]\n> {{\"Create a simple and easy to digest summary of what this article contains, no longer than 1-3 sentences. Keep this summary as approachable and short as possible. When referencing proper nouns that would become separate notes in Obsidian, use double brackets with the full canonical name as the link target, and add an alias only when the contextual display should differ from the full name. For example: use [[Artificial Intelligence|AI]] when 'AI' flows better in the sentence but you want all AI references to link to the same 'Artificial Intelligence' note, use [[John Smith|Dr. Smith]] when referring formally to someone whose full name is John Smith, use [[Machine Learning|ML]] for the abbreviation, or simply [[Machine Learning]] when the full term works naturally in context. The goal is ensuring all references to the same concept/person/thing link to the same canonical note while maintaining natural readability. Only create links for substantial proper nouns, concepts, people, places, or technologies that would realistically have their own dedicated notes\"}}\n\n[[Articles Collection|↖ Articles]] • **[Read this on {{site}}]({{url}})**\n\n## Topics\n{{\"Generate hashtags for this article in a hierarchical structure from extremely broad to increasingly specific. Start with 1-4 domain hashtags that are newspaper-section broad (like #technology, #science, #politics, #culture, #business, #health, #food, #education, #finance, #environment) - these should be so general that hundreds of articles could share them. Then add 2-4 field-specific hashtags that narrow the domain (like #ai, #neuroscience, #foreign-policy, #social-media, #startups, #nutrition, #climate-change). Follow with 2-4 conceptual hashtags that identify key themes, methodologies, or frameworks discussed (like #deep-learning, #cognitive-bias, #market-analysis, #user-experience, #data-visualization). Finally, include 1-3 specific hashtags that capture unique elements, tools, or detailed aspects of this content - these should still have potential to connect with other notes but can be quite precise (like #transformers, #mediterranean-diet, #ab-testing, #figma-plugins). Use single words when sufficient, only adding hyphens when needed for compound concepts or clarity. No spaces in hashtags. Aim for 6-15 total hashtags depending on article complexity and topic breadth. Format as comma-separated hashtags like: #technology, #ai, #neural-networks, #gpt. Avoid redundant concepts, overly generic terms like #information or #content, and words directly from the article title\"}}\n\n## TLDR;\n{{\"Provide 1-6 bullet points of short dependent clause sentences touching on the topics covered in this article. Use markdown bullet format. When referencing proper nouns that would become separate notes in Obsidian, use double brackets with the full canonical name as the link target, and add an alias only when the contextual display should differ from the full name. For example: use [[Artificial Intelligence|AI]] when 'AI' flows better in the sentence but you want all AI references to link to the same 'Artificial Intelligence' note, use [[John Smith|Dr. Smith]] when referring formally to someone whose full name is John Smith, use [[Machine Learning|ML]] for abbreviations, or simply [[Machine Learning]] when the full term works naturally in context. The goal is ensuring all references to the same concept/person/thing link to the same canonical note while maintaining natural readability in each bullet point. Only create links for substantial proper nouns, concepts, people, places, or technologies that would realistically have their own dedicated notes\"}}\n\n### Recap\n\n> [!tip]- What resonates\n> {{\"From this article, identify one specific quote, observation, or idea that would likely stand out to a thoughtful reader. Write 1-2 sentences explaining what it is and why it's noteworthy. Focus on something concrete and meaningful rather than the main thesis\"}}\n\n> [!question]- following up\n> {{\"Based on this article, generate one thoughtful question or area of curiosity that would naturally emerge for an engaged reader. Write 1-2 sentences posing this as a genuine question worth exploring further - either a practical extension or a more abstract angle the article suggests\"}}\n\n{{\"Provide an approachable distilled version of the page's content that is detailed and formatted in Obsidian markdown. The root level heading should be h4 as this will be added below an h3. Break down the distilled version into headings and paragraphs. When referencing proper nouns that would become separate notes in Obsidian, use double brackets with the full canonical name as the link target, and add an alias only when the contextual display should differ from the full name. For example: use [[Artificial Intelligence|AI]] when 'AI' flows better in the sentence but you want all AI references to link to the same 'Artificial Intelligence' note, use [[John Smith|Dr. Smith]] when referring formally to someone whose full name is John Smith, use [[Machine Learning|ML]] for abbreviations, or simply [[Machine Learning]] when the full term works naturally in context. The goal is ensuring all references to the same concept/person/thing link to the same canonical note while maintaining natural readability throughout the formatted content. Only create links for substantial proper nouns, concepts, people, places, or technologies that would realistically have their own dedicated notes\"}}\n\n{{\"When analyzing the content, identify any significant quotes that should be highlighted verbatim. Only if you find genuinely important and noteworthy quotes, create a dedicated quotes section using markdown formatting with this exact structure: 1. Add the section heading: #### Quotes 2. For each quote, create a subheading using this pattern: ##### [Person Name] on [Topic] 3. Present the quote as a markdown blockquote using > 4. Add attribution below each quote: — [[Quoted Person Name]] Important: If there are no especially noteworthy quotes, do not include any quotes section at all. Do not add the ### Quotes heading or any related content. Return nothing for this section. All formatting must use proper markdown syntax. The output should follow this exact markdown pattern: Start with ### Quotes then for each quote use #### [Person] on [Topic] followed by > [quote text]. the person should be wrapped in double brackets `[[like this]]`. if the quoted person is the author of the article, commit the attribution and just set the heading as the topic. do not add an attribution below the quote.\"}}\n\n---\n\n***originally published by [[{{site}}]] on [[{{published|date:\"YYYY-MM-DD\"}}|{{published|date:\"MMMM D, YYYY\"}}]]***\n\n---\n## My notes:\n%% Enter notes below this line %%\n\n",
    "properties": [
        {
            "name": "aliases",
            "value": "",
            "type": "multitext"
        },
        {
            "name": "kind",
            "value": "[[Articles Collection|Articles]]",
            "type": "text"
        },
        {
            "name": "creator",
            "value": "{{\\\"a comma separated list of author(s) of this article. Do not add any characters near or around the square brackets. Each author should be formatted like this: [[author name]].\\\"}}",
            "type": "multitext"
        },
        {
            "name": "publish-date",
            "value": "{{published}}",
            "type": "date"
        },
        {
            "name": "source",
            "value": "{{url}}",
            "type": "multitext"
        },
        {
            "name": "finished",
            "value": "",
            "type": "checkbox"
        }
    ],
    "triggers": [
        "schema:@Article",
        "schema:@BlogPosting",
        "schema:@NewsArticle",
        "schema:@ScholarlyArticle",
        "schema:@TechArticle",
        "schema:@Report",
        "schema:@LiveBlogPosting"
    ],
    "noteNameFormat": "{{title}}",
    "path": "clipped"
}
